mpeskett88/ToneRelay/esp32-p4/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_REV_MIN_301=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
# Bulk 512-byte Helix transfers: keep USB DMA buffers in internal RAM.
# CONFIG_USB_HOST_DWC_DMA_CAP_MEMORY_IN_PSRAM is not set
CONFIG_USB_HOST_ENABLE_ENUM_FILTER_CALLBACK=y
# Helix Floor composite config is >256 bytes (Line 6 units report ~0x130+).
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=4096
# Keep BALANCED. The Kconfig help text (408-byte IN) is ESP32-S3 FS, not P4.
# P4 HS DWC has 1024 FIFO lines. Balanced: RX ~640 lines (~2560 B, several
# 512-byte IN packets) and NPTX 256 lines (~1024 B). Bias IN would shrink
# non-periodic TX to 64 lines (256 B), which cannot hold a Helix stream frame
# (8-byte USB header + 8-byte channel header + 256-byte chunk ≈ 272 B).
CONFIG_USB_HOST_HW_BUFFER_BIAS_BALANCED=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=16384
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y
# A Helix bulk-IN burst can keep the USB client task busy for several seconds.
# The default 5s idle-task watchdog then resets the P4 mid-transfer.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
# httpd max_open_sockets plus hosted/Wi-Fi sockets. Default 10 is too tight
# for the SPA plus a WebSocket (httpd reserves 3 of its own).
CONFIG_LWIP_MAX_SOCKETS=16

CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_TRANSPORT_UART=n
CONFIG_BT_NIMBLE_GATT_MAX_PROCS=8
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=2
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=512

CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=54
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE=y
CONFIG_ESP_HOSTED_NIMBLE_HCI_VHCI=y

CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y
